<?php

use yii\db\Migration;

/**
 * Handles the creation of table `typegamename`.
 */
class m180411_203641_create_typegamename_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('typegamename', [
            'id' => $this->primaryKey(),
            'name'=>$this->string()->notNull()->comment('Вид спорта'),
            'line'=>$this->string()->null()->comment('Линия'),
        ]);

        //19
        $p=[
            ['Футбол','Линия 1'], ['Хоккей','Линия 1'], ['Баскетбол','Линия 1'], ['Теннис','Линия 1'], ['Бейсбол','Линия 1'], ['Волейбол','Линия 1'], ['Гандбол','Линия 1'], ['Киберспорт','Линия 1'], ['Гольф','Линия 1'], ['Борьба','Линия 1'], ['Футзал','Линия 1'], ['Крикет','Линия 1'], ['Шахматы','Линия 1'], ['Бильярд','Линия 1'], ['Регби','Линия 1'], ['Настольный теннис','Линия 1'], ['Бокс','Линия 1'], ['Флорбол','Линия 1'], ['Австралийский футбол','Линия 1'],
            //    ['Футбол','Линия 2'], ['Хоккей','Линия 2'], ['Баскетбол','Линия 2'], ['Теннис','Линия 2'], ['Бейсбол','Линия 2'], ['Волейбол','Линия 2'], ['Гандбол','Линия 2'], ['Киберспорт','Линия 2'], ['Гольф','Линия 2'], ['Борьба','Линия 2'], ['Футзал','Линия 2'], ['Крикет','Линия 2'], ['Шахматы','Линия 2'], ['Бильярд','Линия 2'], ['Регби','Линия 2'], ['Настольный теннис','Линия 2'], ['Бокс','Линия 2'], ['Флорбол','Линия 2'], ['Австралийский футбол','Линия 2']
        ];

        $this->batchInsert('typegamename',['name','line'],$p);

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('typegamename');
    }
}
